DataProcessors/ВыгрузкаApp.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаApp</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиНаценкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаценкиНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Comment>(Общ) Окраничение скидки, наценки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Comment>(Общ) Условие скидки-наценки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГруппыХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспаковатьРостовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНоль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОсновная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузкаApp/Ext/ObjectModule.bsl
Перем ТЗНоменклатуры Экспорт;
Перем Комплектующие;

Процедура ВыполнитьВыгрузку(ПутьКФайлу, Номенклатура = Неопределено, Тест = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЦены = Константы.ТипЦенНашСайт.Получить();
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	
	ТЗНоменклатуры.Колонки.Добавить("ИД");
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура");
	ТЗНоменклатуры.Колонки.Добавить("Характеристика");
	ТЗНоменклатуры.Колонки.Добавить("Количество");
	ТЗНоменклатуры.Колонки.Добавить("Доступна");
	
	Если СтрЧислоВхождений(ПутьКФайлу, ".xml") = 0 Тогда
		
		ПутьКФайлу = ПутьКФайлу + ".xml";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.ИгнорироватьНоль, ЛОЖЬ)) КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТВсеХарактеристики
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		|		ПО ХарактеристикиНоменклатуры.Ссылка = ГруппыХарактеристикХарактеристики.Характеристика
		|ГДЕ
		|	(ХарактеристикиНоменклатуры.Владелец В ИЕРАРХИИ (&Номенклатура)
		|			ИЛИ &НоменклатураВыбрана)
		|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код <> ""000000010""
		|	И НЕ ХарактеристикиНоменклатуры.Владелец.НеВыгружатьНаРозетку
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиНоменклатуры.Владелец,
		|	ХарактеристикиНоменклатуры.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.НеВыгружать, ЛОЖЬ))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
		|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
		|	СУММА(КомплектующиеНоменклатуры.Количество) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.ИгнорироватьНоль, ЛОЖЬ)) КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТКомплектующие
		|ИЗ
		|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
		|		ПО КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры = ГруппыХарактеристикХарактеристики.Характеристика
		|ГДЕ
		|	(КомплектующиеНоменклатуры.Номенклатура В ИЕРАРХИИ (&Номенклатура)
		|			ИЛИ &НоменклатураВыбрана)
		|	И КомплектующиеНоменклатуры.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|	И НЕ КомплектующиеНоменклатуры.Номенклатура.НеВыгружатьНаРозетку
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектующиеНоменклатуры.Комплектующая,
		|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей,
		|	КомплектующиеНоменклатуры.Номенклатура,
		|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ЕСТЬNULL(ГруппыХарактеристикХарактеристики.Ссылка.НеВыгружать, ЛОЖЬ))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комплектующая,
		|	ХарактеристикаКомплектующей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТКомплектующие.Номенклатура КАК Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ВТКомплектующие.Количество > 0
		|					И (ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) / ВТКомплектующие.Количество > 0.5
		|				ТОГДА ВЫРАЗИТЬ((ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) / ВТКомплектующие.Количество - 0.5 КАК ЧИСЛО(15, 0))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Остаток,
		|	ВТКомплектующие.ИгнорироватьНоль КАК ИгнорироватьНоль
		|ПОМЕСТИТЬ ВТ_НКРучные
		|ИЗ
		|	ВТКомплектующие КАК ВТКомплектующие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТКомплектующие.Комплектующая = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТКомплектующие.ХарактеристикаКомплектующей = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТКомплектующие.Комплектующая = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТКомплектующие.ХарактеристикаКомплектующей = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКомплектующие.Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры,
		|	ВТКомплектующие.ИгнорироватьНоль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТВсеХарактеристики.Номенклатура КАК Номенклатура,
		|	ВТВсеХарактеристики.ХарактеристикаНоменклатуры КАК Характеристика
		|ПОМЕСТИТЬ ВТХарактеристикиВНаличии
		|ИЗ
		|	ВТВсеХарактеристики КАК ВТВсеХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТВсеХарактеристики.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТВсеХарактеристики.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТВсеХарактеристики.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТВсеХарактеристики.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТВсеХарактеристики.ИгнорироватьНоль
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НКРучные.Номенклатура,
		|	ВТ_НКРучные.ХарактеристикаНоменклатуры
		|ИЗ
		|	ВТ_НКРучные КАК ВТ_НКРучные
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ_НКРучные.ИгнорироватьНоль
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВТ_НКРучные.Остаток > 0
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТХарактеристикиВНаличии.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Ткани.Свойство, НЕОПРЕДЕЛЕНО) КАК СвойствоТкань,
		|	ЕСТЬNULL(Ткани.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеТкань,
		|	ЕСТЬNULL(Цвета.Свойство, НЕОПРЕДЕЛЕНО) КАК СвойствоЦвет,
		|	ЕСТЬNULL(Цвета.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеЦвет
		|ПОМЕСТИТЬ ВТТканиИЦвета
		|ИЗ
		|	ВТХарактеристикиВНаличии КАК ВТХарактеристикиВНаличии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Ткани
		|		ПО ВТХарактеристикиВНаличии.Характеристика = Ткани.Объект
		|			И (Ткани.Свойство.Код = ""000000065"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Цвета
		|		ПО ВТХарактеристикиВНаличии.Характеристика = Цвета.Объект
		|			И (Цвета.Свойство.Код = ""000000069""
		|				ИЛИ Цвета.Свойство.Код = ""000000072"")
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТХарактеристикиВНаличии.Номенклатура,
		|	СвойствоТкань,
		|	СвойствоЦвет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ЗначенияСвойствОбъектов.Объект КАК ХарактеристикаНоменклатуры
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТТканиИЦвета.Номенклатура КАК Номенклатура,
		|		ЗначенияСвойствОбъектов.Объект КАК ХарактеристикаНоменклатуры,
		|		ВТТканиИЦвета.СвойствоЦвет КАК СвойствоЦвет,
		|		ВТТканиИЦвета.ЗначениеЦвет КАК ЗначениеЦвет
		|	ИЗ
		|		ВТТканиИЦвета КАК ВТТканиИЦвета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ПО ВТТканиИЦвета.Номенклатура = ЗначенияСвойствОбъектов.Объект.Владелец
		|				И (ВЫБОР
		|					КОГДА ВТТканиИЦвета.СвойствоТкань <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ВТТканиИЦвета.СвойствоТкань = ЗначенияСвойствОбъектов.Свойство
		|								И ВТТканиИЦвета.ЗначениеТкань = ЗначенияСвойствОбъектов.Значение
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ВложенныйЗапрос.ХарактеристикаНоменклатуры = ЗначенияСвойствОбъектов.Объект
		|			И ВложенныйЗапрос.СвойствоЦвет = ЗначенияСвойствОбъектов.Свойство
		|			И ВложенныйЗапрос.ЗначениеЦвет = ЗначенияСвойствОбъектов.Значение
		|ГДЕ
		|	НЕ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТканиИЦвета.Номенклатура,
		|	ЗначенияСвойствОбъектов.Объект
		|ИЗ
		|	ВТТканиИЦвета КАК ВТТканиИЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ВТТканиИЦвета.Номенклатура = ЗначенияСвойствОбъектов.Объект.Владелец
		|			И (ВЫБОР
		|				КОГДА ВТТканиИЦвета.СвойствоТкань = НЕОПРЕДЕЛЕНО
		|					ТОГДА ВТТканиИЦвета.СвойствоЦвет = ЗначенияСвойствОбъектов.Свойство
		|							И ВТТканиИЦвета.ЗначениеЦвет = ЗначенияСвойствОбъектов.Значение
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	НЕ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристики.Номенклатура КАК Номенклатура,
		|	ВТХарактеристики.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры) КАК ХарактеристикаНК
		|ПОМЕСТИТЬ ВТХарактеристики_С_НК
		|ИЗ
		|	ВТХарактеристики КАК ВТХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ПО (КомплектующиеНоменклатуры.Номенклатура.ВидНоменклатуры.Код <> ""000000010"")
		|			И ВТХарактеристики.Номенклатура = КомплектующиеНоменклатуры.Комплектующая
		|			И ВТХарактеристики.ХарактеристикаНоменклатуры = КомплектующиеНоменклатуры.ХарактеристикаКомплектующей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТХарактеристики.Номенклатура,
		|	ВТХарактеристики.ХарактеристикаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	ХарактеристикаНК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристики_С_НК.Номенклатура КАК Номенклатура,
		|	ВТХарактеристики_С_НК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки
		|ПОМЕСТИТЬ ВТХарактеристикиСкидкиНаценки
		|ИЗ
		|	ВТХарактеристики_С_НК КАК ВТХарактеристики_С_НК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Комплект)
		|					И (КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &Дата
		|						ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|					И (ПолучательСкидки = НЕОПРЕДЕЛЕНО
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|						ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|					И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
		|					И (ЗначениеУсловия = НЕОПРЕДЕЛЕНО
		|						ИЛИ ЗначениеУсловия = 0
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.ПустаяСсылка)
		|						ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка))) КАК СкидкиНаценкиНоменклатурыСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВТХарактеристики_С_НК.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|					ТОГДА ВТХарактеристики_С_НК.Номенклатура = СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура
		|				ИНАЧЕ ВТХарактеристики_С_НК.ХарактеристикаНК.Владелец = СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТХарактеристики_С_НК.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|					ТОГДА ВТХарактеристики_С_НК.ХарактеристикаНоменклатуры = СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|				ИНАЧЕ ВТХарактеристики_С_НК.ХарактеристикаНК = СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|			КОНЕЦ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТКомплектующие.Номенклатура КАК Номенклатура,
		|	ВТКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТКомплектующие.Комплектующая КАК Комплектующая,
		|	ВТКомплектующие.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
		|	ВТКомплектующие.Количество КАК Количество
		|ИЗ
		|	ВТКомплектующие КАК ВТКомплектующие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.Родитель.Родитель КАК Группа,
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура КАК Номенклатура,
		|	ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ВТВсеХарактеристики.ИгнорироватьНоль КАК ИгнорироватьНоль,
		|	ЛОЖЬ КАК ЭтоНаборКомплектРучной,
		|	ВТХарактеристикиСкидкиНаценки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
		|ИЗ
		|	ВТХарактеристикиСкидкиНаценки КАК ВТХарактеристикиСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстатки
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад В (&МассивСкладов)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеХарактеристики КАК ВТВсеХарактеристики
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ВТВсеХарактеристики.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ВТВсеХарактеристики.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.ВидНоменклатуры.Код <> ""000000010""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.Родитель.Родитель,
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура,
		|	ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры,
		|	ВТ_НКРучные.Остаток,
		|	ВТ_НКРучные.ИгнорироватьНоль,
		|	ИСТИНА,
		|	ВТХарактеристикиСкидкиНаценки.ПроцентСкидкиНаценки
		|ИЗ
		|	ВТХарактеристикиСкидкиНаценки КАК ВТХарактеристикиСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НКРучные КАК ВТ_НКРучные
		|		ПО ВТХарактеристикиСкидкиНаценки.Номенклатура = ВТ_НКРучные.Номенклатура
		|			И ВТХарактеристикиСкидкиНаценки.ХарактеристикаНоменклатуры = ВТ_НКРучные.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ВТХарактеристикиСкидкиНаценки.Номенклатура.ВидНоменклатуры.Код = ""000000010""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика";
	
	ГруппаВсеСклады = Справочники.Склады.НайтиПоКоду("000000053");
	МассивСкладов = Справочники.Склады.ПолучитьМассивСкладов(ГруппаВсеСклады);

	
	
	Запрос.УстановитьПараметр("Номенклатура"       , Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураВыбрана", Не ЗначениеЗаполнено(Номенклатура));
	Запрос.УстановитьПараметр("МассивСкладов"      , МассивСкладов);
	Запрос.УстановитьПараметр("Дата"               , ТекущаяДата());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Комплектующие = РезультатыЗапроса[8].Выгрузить();
	Остатки       = РезультатыЗапроса[9].Выгрузить();
	
	ТЗ = Остатки.СкопироватьКолонки();
	

	ТЗ.Колонки.Добавить("Размер");
	ТЗ.Колонки.Добавить("ИД");
	ТЗ.Колонки.Добавить("СпрГруппыЦветов");
	ТЗ.Колонки.Добавить("Цена");
	ТЗ.Колонки.Добавить("ВНоль");
	ТЗ.Колонки.Добавить("Цвет");
	ТЗ.Колонки.Добавить("Ткань");
	ТЗ.Колонки.Добавить("Подкладка");
	ТЗ.Колонки.Добавить("РознКол");
	
	ТЗ.Колонки.Добавить("ВсеНулевые");
	ТЗ.Колонки.Добавить("Количество");
	
	Для Каждого Стр Из Остатки Цикл
		
		ХарактеристикаОбъект = Стр.Характеристика.ПолучитьОбъект();
		
		Если Стр.ЭтоНаборКомплектРучной Тогда
			
			Цена = 0;
			
			НайденныеСтроки = Комплектующие.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Стр.Номенклатура, Стр.Характеристика));
			
			Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
				
				Цена = Цена + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, ТипЦены, ТекущаяДата());
				
			КонецЦикла;
			
		Иначе
			
			Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, ТипЦены, ТекущаяДата());
			
		КонецЕсли;
		
		Если Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		     
		ГрХар = ХарактеристикаОбъект.ПолучитьРостовку();
		
		Если Не ЗначениеЗаполнено(ГрХар) Тогда
			Продолжить;
		КонецЕсли;	
		
		НС = ТЗ.Добавить();
		
		КолКВыгрузке = ХарактеристикаОбъект.ПолучитьКоличествоКВыгрузкеСУчетомРазбитияРостовкок(Стр.Количество);
		
		ЗаполнитьЗначенияСвойств(НС, Стр);
		
		
		НС.Размер          = ХарактеристикаОбъект.ПолучитьРазмер();
		НС.СпрГруппыЦветов = ОбщегоНазначения.ГруппаЦветовХарактеристики(Стр.Номенклатура, Стр.Характеристика);
		НС.Цена            = Цена;
		НС.ВНоль           = Ложь;
		НС.Цвет            = ХарактеристикаОбъект.ЦветХарактеристики();
		НС.Ткань           = ОбщегоНазначения.ТканьХарактеристики(Стр.Характеристика);
		НС.Подкладка       = ОбщегоНазначения.ПодкладкаХарактеристики(Стр.Характеристика); 
		НС.ИД              = ХарактеристикаОбъект.ИдГруппыПолучить();
		НС.РознКол         = ?(Стр.Остаток < 0, 0, КолКВыгрузке); 
	КонецЦикла;
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	Врем = Формат(ТекущаяДата(), "ДЛФ=T");
	
	Если СтрДлина(Врем) = 7 Тогда
		
		Врем = Лев(Врем, 4);
		
	Иначе
		
		Врем = Лев(Врем, 5);
		
	КонецЕсли;
	
	Разделитель = "			";
	ТД.ЗаписатьСтроку("{
	|[product: 
	| "+Разделитель+"{");
	
	СправочникКатегорий = Справочники.КатегорияНашСайт.Выбрать();
	//Тз.Cортировать("Характеристика, Размер");

	ТзНоменклатура = Тз.Скопировать();	
	ТзНоменклатура.Свернуть("Номенклатура");
		
	Для Каждого Стр Из ТзНоменклатура Цикл
		Номенклатура = Стр.Номенклатура;
		СтрХарактеристик = Тз.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
		//Характеристики.Сортировать("Характеристика");
		ЗаписатьНоменклатуру(ТД,Номенклатура, СтрХарактеристик, Разделитель + "		");
		ТД.ЗаписатьСтроку("
		|},");
		
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("
	|]
	|}");
	
	ТД.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


Процедура ЗаписатьНоменклатуру(ТД, Номенклатура, Стр, Разделитель)
	Если Стр.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();	
	Характеристика = Стр[0].Характеристика;
	
	НаименованиеУкр = НоменклатураОбъект.Наименование(Ложь);
	НаименованиеРус = НоменклатураОбъект.Наименование(Истина);
	
	ОписаниеРу = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Истина);
	ОписаниеУкр = ОбщегоНазначения.ОписаниеДляХарактеристики(Характеристика,Ложь);
	
	ТД.ЗаписатьСтроку(Разделитель + """nameUa"": """+НаименованиеРус+""",
	|"+Разделитель+"""nameRu"" : """+НаименованиеУкр+""",		
	|"+Разделитель+"""descriptionUa"" : ""ОписаниеРу"",
	|"+Разделитель+"""descriptionRu"": ""ОписаниеУкр"",
	|"+Разделитель+"""id"" : """+НоменклатураОбъект.КодБезНоликов() +""",");
	
	
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("НашСайт");
	КодыИсключенияСвойств = Характеристика.ПолучитьОбъект().ПолучитьКодыСвойств();
	
	Свойства = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Номенклатура.КатегорияНашСайт, Характеристика,"name",,,КодыИсключенияСвойств,Истина, Разделитель);
    ТД.ЗаписатьСтроку(Свойства);
	
	ТД.ЗаписатьСтроку(Разделитель+ "characteristics"": [");
	ТД.ЗаписатьСтроку(Разделитель+ "{");

	Для каждого Стр1 из Стр Цикл
		Характеристика = Стр1.Характеристика;
		ЗаписатьХарактеристку(ТД, Характеристика, Разделитель + "	");
		ТД.ЗаписатьСтроку(Разделитель+ "}");

		ТД.ЗаписатьСтроку("
		|");
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьХарактеристку(Тд,Характеристика, Разделитель) 
	Номенклатура = Характеристика.Владелец;
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
	//СтатусОстатка
	ОстатокСклад  = 0;
	ОстатокРезерв = 0;

	СкладРозы = Справочники.Склады.НайтиПоКоду("000000014");   //СкладДержавинская
 	ПараметрыОтбора = Новый Структура("Склад, Номенклатура, ХарактеристикаНоменклатуры");
	ПараметрыОтбора.Склад = СкладРозы ;
	ПараметрыОтбора.Номенклатура = Характеристика.Владелец;
	ПараметрыОтбора.ХарактеристикаНоменклатуры = Характеристика;
		
	ИгнорироватьНоль = ХарактеристикаОбъект.ПолучитьРостовку().ИгнорироватьНоль;
	
	ТЗОстатки = РегистрыНакопления.ТоварыНаСкладах.Остатки(, ПараметрыОтбора, "Номенклатура, ХарактеристикаНоменклатуры");
		 
	Если ТЗОстатки.Количество() Тогда
		ОстатокСклад = ТЗОстатки[0].Количество;
	КонецЕсли;
	
	ТЗОстатки = РегистрыНакопления.ТоварыВРезервеНаСкладах.Остатки(, ПараметрыОтбора, "Номенклатура, ХарактеристикаНоменклатуры");
	Остаток = РегистрыНакопления.ТоварыНаСкладах.Остатки(,ПараметрыОтбора, "Номенклатура, ХарактеристикаНоменклатуры");
	
	Если ТЗОстатки.Количество() И Остаток.Количество() Тогда
		ОстатокРезерв = ТЗОстатки[0].Количество;
		 //ОстатокСклад
	КонецЕсли;
	СвободныйОстаток = ОстатокСклад - ОстатокРезерв;
	
	РознСтатус = ?(СвободныйОстаток > 0, ?(ОстатокСклад     > 0, "InStock" , "InProduction"), ?(ИгнорироватьНоль,"toOder",""));
	ОптСтатус  = ?(СвободныйОстаток > 0, ?(СвободныйОстаток > 0, "InStock" , "InProduction"), ?(ИгнорироватьНоль,"toOder",""));
	
	//Параметры для характеристики
	ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("НашСайт");
	КодыИсключенияСвойств = НоменклатураОбъект.ПолучитьКодыСвойств();
	
	Свойство = ОбщегоНазначения.ЗаписатьСвойстваДляХарактеритси(ТабПараметры, Номенклатура.КатегорияНашСайт, Характеристика,"name",,, КодыИсключенияСвойств, Истина, Разделитель);	
	Тд.ЗаписатьСтроку(Свойство);
	
	ТД.ЗаписатьСтроку(Разделитель + """id"": """ + ХарактеристикаОбъект.КодБезНоликов() + """,
	|"+Разделитель + """priceOpt"": ""1000"", 
	|"+Разделитель+"""priceRozn"": ""1200"",
	|"+Разделитель+"""priceRozn"": ""1200"",
	|"+Разделитель+"""priceDrop"": ""13000"",
	|"+Разделитель+"""count_In_Stock"": "+ТЗОстатки+",
	|"+Разделитель+"""rozn_IsReady"": "+РознСтатус+",
	|"+Разделитель+"""opt_IsReady"": "+ОптСтатус+",
	|"+Разделитель+"""priceSp"": ""хуй"",");
	
	
КонецПроцедуры

Процедура ЗаписатьНоменклатуру1(Стр,Характеристики, ТД)

	//Если Номенклатура.Цена = 0 Тогда 
	//	Сообщить("У характеристики нулевая цена! "+ Стр.Номенклатура.Наименование+" "+Стр.Характеристика.Наименование);
	//	Возврат;
	//КонецЕсли;
	//
	//НайденаНоменклатура = ТЗНоменклатуры.НайтиСтроки(Новый Структура("ИД",ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.Код)+ОбщегоНазначения.УбратьНоликиСлева(Стр.Характеристика.Код)));
	//Если НайденаНоменклатура.Количество()>0 Тогда
	//	Если НЕ Стр.Характеристика = НайденаНоменклатура[0].Характеристика Тогда
	//		Сообщить("У характеристики дублируется код! "+ Стр.Номенклатура.Наименование+" "+Стр.Характеристика.Наименование,СтатусСообщения.Важное);
	//	КонецЕсли;
	//	Возврат;
	//КонецЕсли;
	//
	//
	//РознКол = Стр.РознКол;
	//
	//Стр.ВсеНулевые = ВсеНулевые(Стр, ТЗ);

	//Если РознКол = 0 И Не Стр.ИгнорироватьНоль Тогда
	//	
	//	Доступна       = "";
	//	КоличествоНоль = Истина;
	//	
	//Иначе
	//	
	//	Доступна       = "V";
	//	КоличествоНоль = Ложь;
	//	
	//КонецЕсли;
	//
	////КонецЕсли;
	//

	//	НС = ТЗНоменклатуры.Добавить();
	//
	//НС.ИД             = ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.Код) + ОбщегоНазначения.УбратьНоликиСлева(Стр.Характеристика.Код);
	//НС.Номенклатура   = Стр.Номенклатура;
	//НС.Характеристика = Стр.Характеристика;
	//НС.Количество     = Формат(РознКол, "ЧН=0; ЧГ=0");
	//НС.Доступна       = Доступна;
	//
	////Категория
	//КодК = ОбщегоНазначения.УбратьНоликиСлева(Стр.Номенклатура.КатегорияНашСайт.Родитель.Код);
	//ТД.ЗаписатьСтроку("<categoryId>"+КодК+"</categoryId>");
	//
	////Наименование
	////Тип товара - Бренд - Модель - Размер (если имеет значение) - Цвет (если имеет значение) - Артикул (если есть)
	//ТипС = ОбщегоНазначения.СоответвиеСвойстваЗначение(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000037"),ОбщегоНазначения.СвойстваОбъекта(Стр.Номенклатура,"000000037"),Истина,"1");
	//Если ЗначениеЗаполнено(ТипС) Тогда
	//	ТипТ = ТипС.Имя;
	//	Если НЕ ЗначениеЗаполнено(ТипТ) Тогда
	//		ТипТ = СокрЛП(ОбщегоНазначения.СвойстваОбъекта(Стр.Номенклатура,"000000037"));
	//	КонецЕсли;
	//Иначе
	//	ТипТ = "";
	//КонецЕсли;
	//Разм = ОбщегоНазначения.СвойстваОбъекта(Стр.Характеристика,"000000099");
	//Цв = ОбщегоНазначения.ЦветХарактеристики(Стр.Характеристика);
	//Арт = ОбщегоНазначения.ШтрихкодХарактеристики(Стр.Характеристика);
	//ТипИзд  = СокрЛП(ОбщегоНазначения.СвойстваОбъекта(Стр.Номенклатура,"000000037"));
	////Наим = ?(ЗначениеЗаполнено(ТипТ),ТипТ,"")+" Cvetkov "+Стр.Номенклатура.НаименованиеПолное
	////		+" "+СтрЗаменить(СтрЗаменить(Стр.Характеристика.Наименование,",",""),".","")
	////		//+?(ЗначениеЗаполнено(Разм)," "+Разм.Наименование,"")
	////		//+?(ЗначениеЗаполнено(Цв)," "+Цв,"")
	////		+?(ЗначениеЗаполнено(Арт)," "+Арт,"");
	//
	//Наим = Стр.Номенклатура.НаименованиеПолное;
	////+" "+СтрЗаменить(СтрЗаменить(Стр.Характеристика.Наименование,",",""),".","");
	////Наим = СтрЗаменить(Наим,Разм,"");
	//
	////ТД.ЗаписатьСтроку("<model>"+ТипИзд+ " " +Наим+"</model>");
	//ТД.ЗаписатьСтроку("<model>"+Наим+"</model>");
	//
	////ТД.ЗаписатьСтроку("<portal_category_url>"+Стр.Номенклатура.НоменклатурнаяГруппа.url+"</portal_category_url>");
	//
	//ТД.ЗаписатьСтроку("<currencyId>UAH</currencyId>");
	//
	////скидка
	//ПроцСкидки = БИАС.ПолучитьОбщуюСкидку(Стр.Номенклатура, Стр.Характеристика);
	//
	//ТД.ЗаписатьСтроку("<discount>"       + ОбщегоНазначения.НормальноеЧисло(ПроцСкидки)                          + "</discount>");
	//ТД.ЗаписатьСтроку("<discount_groap>" + ?(Стр.ПроцентСкидкиНаценки = 0, "", Строка(Стр.ПроцентСкидкиНаценки)) + "</discount_groap>");
	//	
	////Еслис ПроцСкидки>0 Тогда
	////	ТД.ЗаписатьСтроку("<oldprice>"+ОбщегоНазначения.НормальноеЧисло(Строка(Стр.Цена))+"</oldprice>");
	////	ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Формат(Стр.Цена*(1-ПроцСкидки/100),"ЧДЦ="))+"</price>");
	////Иначе
	////	ТД.ЗаписатьСтроку("<price>"+ОбщегоНазначения.НормальноеЧисло(Строка(Стр.Цена))+"</price>");
	////КонецЕли;
	//
	//ОптЦ   = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001");
	//МОптЦ  = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000014");
	//РознЦ  = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000020");
	//ДропЦ  = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000002");
	//РеликЦ = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000005");
	//СПЦ    = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000022");
	//
	//Если Стр.ЭтоНаборКомплектРучной Тогда
	//	
	//	ЦенОпт   = 0;
	//	ЦенМОпт  = 0;
	//	ЦенРозн  = 0;
	//	ЦенДроп  = 0;
	//	ЦенРелик = 0;
	//	ЦенСП    = 0;
	//	
	//	НайденныеСтроки = Комплектующие.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Стр.Номенклатура, Стр.Характеристика));
	//	
	//	Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
	//		
	//		ЦенОпт   = ЦенОпт   + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, ОптЦ  , ТекущаяДата());
	//		ЦенМОпт  = ЦенМОпт  + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, МОптЦ , ТекущаяДата());
	//		ЦенРозн  = ЦенРозн  + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, РознЦ , ТекущаяДата());
	//		ЦенДроп  = ЦенДроп  + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, ДропЦ , ТекущаяДата());
	//		ЦенРелик = ЦенРелик + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, РеликЦ, ТекущаяДата());
	//		ЦенСП    = ЦенСП    + СтрокаТЗ.Количество * Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЗ.Комплектующая, СтрокаТЗ.ХарактеристикаКомплектующей, СПЦ   , ТекущаяДата());
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//	
	//	ЦенОпт   = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, ОптЦ  , ТекущаяДата());
	//	ЦенМОпт  = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, МОптЦ , ТекущаяДата());
	//	ЦенРозн  = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, РознЦ , ТекущаяДата());
	//	ЦенДроп  = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, ДропЦ , ТекущаяДата());
	//	ЦенРелик = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, РеликЦ, ТекущаяДата());
	//	ЦенСП    = Ценообразование.ПолучитьЦенуНоменклатуры(Стр.Номенклатура, Стр.Характеристика, СПЦ   , ТекущаяДата());
	//	
	//КонецЕсли;
	//
	//ТД.ЗаписатьСтроку("<priceOpt>"   + ОбщегоНазначения.НормальноеЧисло(ЦенОпт)   + "</priceOpt>");
	//ТД.ЗаписатьСтроку("<priceMOpt>"  + ОбщегоНазначения.НормальноеЧисло(ЦенМОпт)  + "</priceMOpt>");
	//ТД.ЗаписатьСтроку("<priceRoz>"   + ОбщегоНазначения.НормальноеЧисло(ЦенРозн)  + "</priceRoz>");
	//ТД.ЗаписатьСтроку("<pricedrop>"  + ОбщегоНазначения.НормальноеЧисло(ЦенДроп)  + "</pricedrop>");
	//ТД.ЗаписатьСтроку("<priceRelik>" + ОбщегоНазначения.НормальноеЧисло(ЦенРелик) + "</priceRelik>");
	//ТД.ЗаписатьСтроку("<priceSP>"    + ОбщегоНазначения.НормальноеЧисло(ЦенСП)    + "</priceSP>");
	//ТД.ЗаписатьСтроку("<year>"    + Прав(Стр.Номенклатура.Родитель.Наименование,4)    + "</year>");

	//                                 
	//Если ЦенОпт > 0 И ЦенМОпт > 0 Тогда
	//	
	//	ТД.ЗаписатьСтроку("<markup>" + Формат(Цел((ЦенМОпт / ЦенОпт - 1) * 100), "ЧГ=0") + "_% </markup>");
	//	
	//КонецЕсли;
	//
	//ТД.ЗаписатьСтроку("<article>" + Стр.Характеристика.Код                                      + "</article>");
	//ТД.ЗаписатьСтроку("<barcode>" + ОбщегоНазначения.ШтрихкодХарактеристики(Стр.Характеристика) + "</barcode>");
	//
	//ГруппаХарактеристик = ОбщегоНазначения.ХарактеристикаВГруппе(Стр.Характеристика);
	//
	//Если ЗначениеЗаполнено(ГруппаХарактеристик) Тогда
	//	
	//	ТД.ЗаписатьСтроку("<group_creation>" + ?(ЗначениеЗаполнено(ГруппаХарактеристик.ДатаСоздания), Формат(ГруппаХарактеристик.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'"), "") + "</group_creation>");
	//	
	//	Если ГруппаХарактеристик.ИгнорироватьНоль Тогда
	//		
	//		ТД.ЗаписатьСтроку("<pro_label>10</pro_label>");
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//МассивСкладов = ПолучитьМассивСкладов(Справочники.Склады.НайтиПоКоду("000000034"));
	//
	//ОптКол = ОбщегоНазначения.ОстатокНоменклатуры(Стр.Характеристика.Владелец, МассивСкладов, Стр.Характеристика, ТекущаяДата())
	//- ОбщегоНазначения.РезервНоменклатуры (Стр.Характеристика.Владелец, МассивСкладов, Стр.Характеристика, ТекущаяДата());
	//
	//Если ОптКол < 0 Тогда
	//	
	//	ОптКол = 0;
	//	
	//КонецЕсли;
	//
	//ТД.ЗаписатьСтроку("<stock_quantity_rozn>" + Формат(РознКол, "ЧН=0; ЧГ=0") + "</stock_quantity_rozn>");
	//ТД.ЗаписатьСтроку("<stock_quantity_opt>"  + Формат(ОптКол, "ЧН=0; ЧГ=0") + "</stock_quantity_opt>");
	//ТД.ЗаписатьСтроку("<status_opt>" + Стр.РознСтатус  + "</status_opt>");
	//ТД.ЗаписатьСтроку("<status_Rozn>" + Стр.ОптСтатус + "</status_Rozn>");
	//
	//
	//ТД.ЗаписатьСтроку("<keywords>"+ОбщегоНазначения.КлючевыйСловаГруппы(Стр.Номенклатура.НоменклатурнаяГруппа)+"</keywords>");
	//
	//Если Стр.Номенклатура.ДополнительноеОписаниеНоменклатуры = "<p>Описание отсутствует</p>" Тогда
	//	Описание = "";
	//Иначе
	//	Описание = НормОписание(Стр.Номенклатура.ДополнительноеОписаниеНоменклатуры);
	//КонецЕсли;

	//ДобавитьТаблицуВОписание(Описание,Стр,Стр.СпрГруппыЦветов);
	//
	//Описание =  "<![CDATA["+Описание+"]]>";
	//	
	//
	//
	////фото
	//ЗаписатьПустойТег_picture = Истина;
	//
	//Если ЗначениеЗаполнено(Стр.СпрГруппыЦветов) Тогда
	//	
	//	ТабФото = ОбщегоНазначения.ФотографииГруппыЦветов(Стр.СпрГруппыЦветов);
	//	
	//	Для Каждого Фот Из ТабФото Цикл
	//		
	//		Если Фот.НеВыгружать Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ИмяФото = Фот.Наименование;
	//		
	//		Если Фот.Главная Тогда
	//			
	//			ТД.ЗаписатьСтроку("<cover>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</cover>");
	//			
	//		КонецЕсли;
	//		
	//		ТД.ЗаписатьСтроку("<picture>" + "http://cvetkovtm.com/assets/shop/sync/imgJpg/" + ИмяФото + "</picture>");
	//		
	//		ЗаписатьПустойТег_picture = Ложь;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	//Если ЗаписатьПустойТег_picture Тогда
	//	
	//	ТД.ЗаписатьСтроку("<picture></picture>");
	//	
	//КонецЕсли;
	//
	////Параметры
	//ТабПараметры = ОбщегоНазначения.ПараметрыКВыгрузке("5");
	//ТабСвойств = ТабПараметры.скопировать();
	//ТабСвойств.Свернуть("Свойство");
	//
	//ЦвХ = ОбщегоНазначения.ЦветХарактеристикиЗн(Стр.Характеристика);
	//
	//Если ТипЗнч(ЦвХ)= Тип("СправочникСсылка.АСБ_ЦветаНоменклатуры") Тогда
	//	Цв1 = ""; Цв2 = ""; ЦвФ1="";ЦвФ2="";
	//	Если ЦвХ.ТипЦвета1 = "RGB" Тогда
	//		Если (ЦвХ.Красный+ЦвХ.Зеленый+ЦвХ.Голубой)>0 Тогда
	//			Цв1 = ОбщегоНазначения.Код16(ЦвХ.Красный,ЦвХ.Зеленый,ЦвХ.Голубой);
	//		Иначе
	//			Цв1="#000000";
	//		КонецЕсли;
	//	ИначеЕсли   ЦвХ.ТипЦвета1 = "HEX" Тогда
	//		Если СокрЛП(ЦвХ.ЦветХекс) = "" Тогда
	//			Цв1 = "";
	//		Иначе
	//			Цв1 = "#"+ЦвХ.ЦветХекс;
	//		КонецЕсли;
	//	ИначеЕсли   ЦвХ.ТипЦвета1 = "RAL" Тогда
	//		Если ЗначениеЗаполнено(ЦвХ.Цвет.Код16) Тогда
	//			Цв1 = ЦвХ.Цвет.Код16;
	//		Иначе 
	//			Цв1 = "";
	//		КонецЕсли;
	//	Иначе
	//		Карт = ЦвХ.ЦветФайл.Получить();
	//		Если НЕ Карт = Неопределено Тогда
	//			ЦвФ1 = "http://cvetkovtm.com/assets/shop/sync/imgJpg/color"+ЦвХ.Код+"_1.jpg";
	//		Иначе
	//			ЦвФ1 = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если ЦвХ.ТипЦвета2 = "RGB" Тогда
	//		Если (ЦвХ.Красный1+ЦвХ.Зеленый1+ЦвХ.Голубой1)>0 Тогда
	//			Цв2 = ОбщегоНазначения.Код16(ЦвХ.Красный1,ЦвХ.Зеленый1,ЦвХ.Голубой1);
	//		Иначе
	//			Цв2="#000000";
	//		КонецЕсли;
	//	ИначеЕсли   ЦвХ.ТипЦвета2 = "HEX" Тогда
	//		Если СокрЛП(ЦвХ.ЦветХекс1) = "" Тогда
	//			Цв2 = "";
	//		Иначе
	//			Цв2 = "#"+ЦвХ.ЦветХекс1;
	//		КонецЕсли;
	//	ИначеЕсли   ЦвХ.ТипЦвета2 = "RAL" Тогда
	//		Если ЗначениеЗаполнено(ЦвХ.Цвет1.Код16) >0 Тогда
	//			Цв2 =  ЦвХ.Цвет1.Код16;
	//		Иначе 
	//			Цв2 = "";
	//		КонецЕсли;
	//	Иначе
	//		Карт = ЦвХ.ЦветФайл1.Получить();
	//		Если НЕ Карт = Неопределено Тогда
	//			ЦвФ2 = "http://cvetkovtm.com/assets/shop/sync/imgJpg/color"+ЦвХ.Код+"_2.jpg";
	//		Иначе
	//			ЦвФ2 = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИтЦв = "";
	//	Если НЕ СокрЛП(Цв1)="" Тогда
	//		ИтЦв = ИтЦв+Цв1;
	//	КонецЕсли;
	//	
	//	Если НЕ СокрЛП(Цв1)="" И НЕ СокрЛП(Цв2)=""  Тогда
	//		ИтЦв = ИтЦв+"|"+Цв2;
	//	КонецЕсли;
	//	
	//	Если СокрЛП(Цв1)="" И НЕ СокрЛП(Цв2)=""  Тогда
	//		ИтЦв = Цв2;
	//	КонецЕсли;
	//	
	//	Если  СокрЛП(ИтЦв) = "" Тогда  // просто RAL
	//		ИтЦв = ЦвХ.Цвет.Код16;
	//	КонецЕсли;
	//		
	//	ТД.ЗаписатьСтроку("<colorCode>"+ИтЦв+"</colorCode>");
	//	
	//	Если ЗначениеЗаполнено(ЦвФ1) Тогда
	//		ТД.ЗаписатьСтроку("<colorPath>"+ЦвФ1+"</colorPath>");
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ЦвФ2) Тогда
	//		ТД.ЗаписатьСтроку("<colorPath>"+ЦвФ2+"</colorPath>");
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипЗнч(ЦвХ) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И
	//	Не ПустаяСтрока(ЦвХ.КодЦвета) Тогда
	//	
	//	ТД.ЗаписатьСтроку("<colorCode>" + СокрЛП(ЦвХ.КодЦвета) + "</colorCode>");
	//	
	//КонецЕсли;
	//
	//ТД.ЗаписатьСтроку("<color>"+СокрЛП(ЦвХ)+"</color>");
	//
	//
	//
	//ТД.ЗаписатьСтроку("<param name=""Страна производитель"">Украина</param>");
	////ТД.ЗаписатьСтроку("<param name=""Артикул"">"+Арт+"</param>");
	//
	//	
	////Замеры
	////
	////ТабЗамеров = ОбщегоНазначения.ЗамерыПолучитьТЗ(Стр.Номенклатура,Стр.Характеристика);
	////
	////Для Каждого Стр1 Из ТабЗамеров Цикл
	////	Если Не ЗначениеЗаполнено(Стр1.Замер) Тогда Продолжить; КонецЕсли;
	////	ТД.ЗаписатьСтроку("<param name="""+СокрЛП(Стр1.Поле)+""">"+СокрЛП(Стр1.Замер)+"</param>");
	////КонецЦикла;
	//ТД.ЗаписатьСтроку("<description>"+Описание+"</description>");

	//ТД.ЗаписатьСтроку("</offer>");
	
КонецПроцедуры



Функция НормОписание(Описание)
	
	Опис = Описание;
	
	Опис = СтрЗаменить(Опис, """"      , "&quot");
	Опис = СтрЗаменить(Опис, "&"       , "&amp");
	//Опис = СтрЗаменить(Опис, ">"       , "&gt");
	//Опис = СтрЗаменить(Опис, "<"       , "&lt");
	Опис = СтрЗаменить(Опис, "'"       , "&apos");
	Опис = СтрЗаменить(Опис, Символы.ПС, " ");
	
	Возврат Опис;
	
КонецФункции

Процедура ВыполнитьВыгрузкуНК(ПутьКФайлу, Номенклатура = Неопределено, Тест = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтрЧислоВхождений(ПутьКФайлу, ".xml") = 0 Тогда
		
		ПутьКФайлу = ПутьКФайлу + ".xml";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
		|ПОМЕСТИТЬ ВТСкидкиНаценки
		|ИЗ
		|	РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Комплект)
		|				И (КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &Дата
		|					ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|				И (ПолучательСкидки = НЕОПРЕДЕЛЕНО
		|					ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|					ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|					ИЛИ ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|				И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
		|				И (ЗначениеУсловия = НЕОПРЕДЕЛЕНО
		|					ИЛИ ЗначениеУсловия = 0
		|					ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)
		|					ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.ПустаяСсылка)
		|					ИЛИ ЗначениеУсловия = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка))) КАК СкидкиНаценкиНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Владелец КАК НК,
		|	ХарактеристикиНоменклатуры.Владелец.Наименование КАК НКНаименование,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|   ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристики,
		|	ЕСТЬNULL(ВТСкидкиНаценки.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСкидкиНаценки КАК ВТСкидкиНаценки
		|		ПО ХарактеристикиНоменклатуры.Владелец = ВТСкидкиНаценки.Номенклатура
		|			И ХарактеристикиНоменклатуры.Ссылка = ВТСкидкиНаценки.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры
		|	И НЕ ХарактеристикиНоменклатуры.Владелец.ПометкаУдаления
		|	И (ХарактеристикиНоменклатуры.Владелец В ИЕРАРХИИ (&Номенклатура)
		|			ИЛИ &НоменклатураВыбрана)";
	
	
	Запрос.УстановитьПараметр("Дата"               , ТекущаяДата());
	Запрос.УстановитьПараметр("ВидНоменклатуры"    , Справочники.ВидыНоменклатуры.НайтиПоКоду("000000009"));
	Запрос.УстановитьПараметр("Номенклатура"       , Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураВыбрана", Не ЗначениеЗаполнено(Номенклатура));
	
	Рез = Запрос.Выполнить().Выгрузить();
	//Рез.фильтрТабы
	//Рез.Свернуть("НКНаименование,НаименованиеХарактеристики");
	
	ТД = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	Врем = Формат(ТекущаяДата(), "ДЛФ=T");                                 
	
	Если СтрДлина(Врем) = 7 Тогда
		
		Врем = Лев(Врем, 4);
		
	Иначе
		
		Врем = Лев(Врем, 5);
		
	КонецЕсли;
	
	ТД.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?>
					  |<!DOCTYPE yml_catalog SYSTEM ""shops.dtd"">
					  |<yml_catalog date=""" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + " " + Врем + """>
					  |<shop>
					  |<name>Cvetkov</name>
					  |<url>http://www.cvetkovtm.com/</url>
					  |<currencies>
					  |<currency id=""UAH"" rate=""1""/>
					  |</currencies>");
	
	ТД.ЗаписатьСтроку("<offers>");
	
	Для Каждого Стр Из Рез Цикл
		Характеристика = Стр.Характеристика; 
		ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
		
		ИД      = Характеристика.Код;	
		КомплНК = Характеристика.Комплектующие_НК();		
		
		Если КомплНК.Количество() > 0 Тогда 
			Ном = КомплНК[0].комплектующая;
			
			Если Не ЕстьОстатокПоНоменклатуре(Ном) Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		
		
		Если КомплНК.Количество() > 0 Тогда
			ХарактеристикаКомплектующей =  КомплНК[0].ХарактеристикаКомплектующей;
			ХарактеристикаКомплектующейОбъект = ХарактеристикаКомплектующей.ПолучитьОбъект();
			
			Если ХарактеристикаКомплектующей.Наименование = "" Тогда 
				Продолжить;
			КонецЕсли;
			Цвет      = ХарактеристикаКомплектующейОбъект.ЦветХарактеристики();
			Ткань     = ОбщегоНазначения.ТканьХарактеристики(КомплНК[0].ХарактеристикаКомплектующей);
			Подкладка = ОбщегоНазначения.ПодкладкаХарактеристики(КомплНК[0].ХарактеристикаКомплектующей);
			ИДГР      = ХарактеристикаКомплектующейОбъект.ИдГруппыПолучить();
			ИдМод     = ХарактеристикаКомплектующей.Владелец.Код;
			
		Иначе
			Продолжить;
			Цвет      = "";
			Ткань     = "";
			Подкладка = "";
			ИДГР      = "";
			ИдМод     = "";
			
		КонецЕсли;
		
				
		Прод = "";
		Ном  = 1;
		
		Вналичии = Истина;
		ЕстьОстаток = Истина;
		
		НеВыгружать = Истина;
		
		Для Каждого Стр1 Из КомплНК Цикл
			
			//КолКВыгрузке = ОбщегоНазначения.КоличествоКВыгрузке(Стр1.ХарактеристикаКомплектующей);
			//       
			//Если КолКВыгрузке>0 Тогда
			//	 НеВыгружать = Ложь;
			//КонецЕсли;
			
			//СтатусОстатка
			ОстатокСклад  = 0;
			ОстатокРезерв = 0;

			СкладРозы = Справочники.Склады.НайтиПоКоду("000000014");   //СкладДержавинская
	 		ПараметрыОтбора = Новый Структура("Склад, Номенклатура, ХарактеристикаНоменклатуры");
			ПараметрыОтбора.Склад = СкладРозы ;
			ПараметрыОтбора.Номенклатура = Стр1.Комплектующая;
			ПараметрыОтбора.ХарактеристикаНоменклатуры = Стр1.ХарактеристикаКомплектующей;

								
			
			Прод = Прод + ОбщегоНазначения.УбратьНоликиСлева(Стр1.ХарактеристикаКомплектующей.Владелец.Код) + ОбщегоНазначения.УбратьНоликиСлева(Стр1.ХарактеристикаКомплектующей.Код);
			
			Если Не Ном = КомплНК.Количество() Тогда
				
				Прод = Прод + ",";
				
			КонецЕсли;
			
 			Ном = Ном + 1;
			
		КонецЦикла;
		
		Если Прод = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НеВыгружать Тогда 
			//Продолжить;
		КонецЕсли;
		
		ТД.ЗаписатьСтроку("<offer  id=""" + ИД + """ model_id=""" + ОбщегоНазначения.УбратьНоликиСлева(ИдМод) + """ group_id=""" + ИДГР + """>");
		
		Наименование = СтрЗаменить(Стр.НК.Наименование, "(НК)", "") + ?(ЗначениеЗаполнено(СокрЛП(Ткань)), " " + СокрЛП(Ткань), "") + ?(ЗначениеЗаполнено(СокрЛП(Цвет)), " " + Цвет, "");
		
		ТД.ЗаписатьСтроку("<name>" + Наименование + "</name>");

		
		Если КомплНК.Количество() <> 0 Тогда
			ХарактеристикаОбъект = (КомплНК[0].характеристикакомплектующей.ПолучитьОбъект());
			Если ХарактеристикаОбъект.ПолучитьРостовку() <> Неопределено Тогда
				ИгнорироватьНоль = ХарактеристикаОбъект.ИгнорироватьНоль;
			
				Если ИгнорироватьНоль Тогда
					ТД.ЗаписатьСтроку("<pro_label>" + 10 + "</pro_label>");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		 
		ТД.ЗаписатьСтроку("<products>" + Прод + "</products>");             
		ТД.ЗаписатьСтроку("<status>" + ?(ЕстьОстаток, ?(Вналичии,"В наявності", "На виробництві"), ?(ИгнорироватьНоль,"Предзамовлення","")) + "</status>");
		
		ТД.ЗаписатьСтроку("<discount_groap>" + ?(Стр.ПроцентСкидкиНаценки = 0, "", Строка(Стр.ПроцентСкидкиНаценки)) + "</discount_groap>");		
	
		ТД.ЗаписатьСтроку("</offer>");                              
		
	КонецЦикла;
	
	ТД.ЗаписатьСтроку("</offers>
					  |</shop>
					  |</yml_catalog>");
	
	ТД.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

функция ЕстьОстатокПоНоменклатуре(Номенклатура) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	              |ИЗ
	              |	РегистрНакопления.ТоварыНаСкладах.Остатки(
			      |     	&НаДату,
				  |			Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки";
	            	
	
	Запрос.УстановитьПараметр("Номенклатура" , Номенклатура);
	Запрос.УстановитьПараметр("НаДату" , ТекущаяДата());
		
	Рез = Запрос.Выполнить().Выгрузить();
	
	Кол = Рез.Итог("КоличествоОстаток");
	
	Если Кол > 0 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
конецФункции

Функция ВсеНулевые(Стр, Таб)
	
	Все0 = Истина;
	
	ТЗ = Таб.НайтиСтроки(Новый Структура("Номенклатура, Цвет, Ткань", Стр.Номенклатура, Стр.Цвет, Стр.Ткань));
	
	Для Каждого Стр1 Из ТЗ Цикл
		
		Если Не Стр1.РознКол = 0 Тогда
			
			Все0 = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Все0;
	
КонецФункции
